app/controllers/savings_controller.rb

  def index
    puts params
    @savings = Saving.where(vendor_id: params[:vendor_id]).order(id: :desc)
---
SELECT "savings".* FROM "savings" WHERE "savings"."vendor_id" = $1 ORDER BY "savings"."id" DESC  [["vendor_id", 1]]

  def create
    @saving = Saving.new(saving_params)
    vendor = Vendor.find(params[:vendor_id])
    @saving.vendor = vendor
    if @saving.save
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "savings" ("original_cost", "savings_cost", "discount", "month", "vendor_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["original_cost", "111.11"], ["savings_cost", "111.11"], ["discount", "0.0"], ["month", "Jan"], ["vendor_id", 1]]

  def destroy
    @saving.destroy
---
DELETE FROM "savings" WHERE "savings"."id" = $1  [["id", 30]]

  def set_saving
    @saving = Saving.find(params[:id])
---
SELECT "savings".* FROM "savings" WHERE "savings"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]