app/controllers/savings_controller.rb

SELECT "savings".* FROM "savings"
---
  def index
    @savings = Saving.all