app/controllers/vendors_controller.rb

  def index
    @vendors = Vendor.all
---
SELECT "vendors".* FROM "vendors"

  def set_vendor
    @vendor = Vendor.find(params[:id])
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]